eventable/app/views/updates/index.html.haml

SELECT COUNT(*) FROM "updates" WHERE "updates"."event_id" = ?  [["event_id", 2]]
---
    .div.title
      = "#{pluralize @updates.count, "update"} in #{@event_name}"