eventable/app/views/schedules/index.html.haml

    .div.title
      = "#{pluralize @schedules.count, "schedule"} in #{@event_name}"
---
SELECT COUNT(*) FROM "schedules" WHERE "schedules"."event_id" = ?  [["event_id", 2]]