eventable/app/controllers/schedules_controller.rb

  def index
    @event_id = params[:event_id]
    event = Event.find_by(id: @event_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 12]]

  def new
    @edit = params[:edit]
    @event_id= params[:event_id]
    @event = Event.find_by(id: @event_id)
    if @event.nil?
      flash[:notice] = "Event does not exist"
    end
    if @edit.present?
      @schedule_id = params[:schedule_id]
      @schedule = Schedule.find_by(id: @schedule_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 30]]

  def destroy
    id = params[:id]
    event_id = params[:event_id]
    schedule = Schedule.find_by(id: id)
    if schedule.nil?
      flash[:notice] = "Schedule does not exist"
    else
      schedule.destroy
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 3]]

  def create
    event_id= params[:event_id]
    @event = Event.find_by(id: event_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]

      # redirect to index
      schedule_id = params[:schedule_id]
      if schedule_id.present?
        schedule = Schedule.find_by(id: schedule_id)
---
SELECT  "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT 1  [["id", 32]]

          schedule.description = @description
          schedule.start_time = @start_date
          schedule.end_time = @end_date
          schedule.save
---
INSERT INTO "schedules" ("description", "start_time", "end_time", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "schedules" SET "description" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["description", "Creates a text input area; use a textarea for longer text inputs such as blog posts or descriptions.\r\n\r\n- Roy Li"], ["updated_at", "2015-10-07 01:24:29.650484"], ["id", 32]]