eventable/app/controllers/updates_controller.rb

  def index
    @event_id = params[:event_id]
    event = Event.find_by(id: @event_id)
    if event.nil?
      flash[:notice] = "Event does not exist"
    else
      @updates = event.updates.order('created_at DESC')
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT "updates".* FROM "updates" WHERE "updates"."event_id" = ?  ORDER BY "updates"."created_at" ASC  [["event_id", 2]]

  def new
    @edit = params[:edit]
    @event_id= params[:event_id]
    @event = Event.find_by(id: @event_id)
    if @event.nil?
      flash[:notice] = "Event does not exist"
    end
    if @edit.present?
      @update_id = params[:update_id]
      @update = Update.find_by(id: @update_id)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT 1  [["id", 9]]

  def destroy
    id = params[:id]
    event_id = params[:event_id]
    update = Update.find_by(id: id)
    if update.nil?
      flash[:notice] = "Update does not exist"
    else
      update.destroy
---
SELECT  "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT 1  [["id", 3]]
DELETE FROM "updates" WHERE "updates"."id" = ?  [["id", 3]]

  def create
    description = params["description"]
    event_id = params["event_id"]
    event = Event.find_by(id: event_id)
    if event.nil?
      flash[:notice] = "Event does not exist"
      return redirect_to action: "new"
    end
    if description.nil? || description.length == 0
      flash[:notice] = "Description is required"
      return redirect_to action: "new", event_id: event_id
    end
    update_id = params[:update_id]
    if update_id.present?
      update = Update.find_by(id: update_id)
      unless update.nil?
        update.description = description
        update.save
      end
    else
      update = Update.new(description: description)
      event.updates << update
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "updates".* FROM "updates" WHERE "updates"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "updates" SET "description" = ?, "updated_at" = ? WHERE "updates"."id" = ?  [["description", "www!!"], ["updated_at", "2015-10-07 01:33:22.892884"], ["id", 9]]
INSERT INTO "updates" ("description", "event_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "This is a really cool update "], ["event_id", 2], ["created_at", "2015-10-07 00:41:11.005229"], ["updated_at", "2015-10-07 00:41:11.005229"]]